Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавочныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Сотрудники/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	// Пропускаем проверку, если запись уже отменена
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка обязательного поля ФИО
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ФИО) Тогда
		Сообщить("Поле ФИО не заполнено!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка, что ФИО содержит только буквы и пробелы
	ФИО = СокрЛП(ЭтотОбъект.ФИО);
	Для Позиция = 1 По СтрДлина(ФИО) Цикл
		Символ = Сред(ФИО, Позиция, 1);
		Если Не (СтрНайти(" абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ-", Символ) > 0) Тогда
			Сообщить("ФИО содержит недопустимые символы! Допустимы только буквы и пробелы.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка обязательного поля ТабельныйНомер
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ТабельныйНомер) Тогда
		Сообщить("Поле Табельный номер не заполнено!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка формата ТабельногоНомера (не более 6 цифр)
	ТабельныйНомер = СокрЛП(ЭтотОбъект.ТабельныйНомер);
	Если СтрДлина(ТабельныйНомер) > 6 Тогда
		Сообщить("Табельный номер не должен превышать 6 цифр!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Для Позиция = 1 По СтрДлина(ТабельныйНомер) Цикл
		Символ = Сред(ТабельныйНомер, Позиция, 1);
		Если СтрНайти("0123456789", Символ) = 0 Тогда
			Сообщить("Табельный номер содержит недопустимые символы! Допустимы только цифры.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка обязательного поля КонтактныйТелефон
	Если Не ЗначениеЗаполнено(ЭтотОбъект.КонтактныйТелефон) Тогда
		Сообщить("Поле Контактный телефон не заполнено!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка формата КонтактныйТелефон: +7 (XXX) XXX-XX-XX
	Телефон = СокрЛП(ЭтотОбъект.КонтактныйТелефон);
	ДопустимыеСимволы = "0123456789+() -";
	Для Позиция = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, Позиция, 1);
		Если СтрНайти(ДопустимыеСимволы, Символ) = 0 Тогда
			Сообщить("Контактный телефон содержит недопустимые символы! Допустимы только цифры, '+', '(', ')', пробел и '-'.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка длины
	Если СтрДлина(Телефон) > 20 Тогда
		Сообщить("Контактный телефон превышает допустимую длину (20 символов)!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка формата телефона: +7 (XXX) XXX-XX-XX
	МассивЧастейТелефона = СтрРазделить(Телефон, " ", Ложь);
	Если МассивЧастейТелефона.Количество() <> 3 Тогда
		Сообщить("Контактный телефон должен быть в формате +7 (XXX) XXX-XX-XX (например, +7 (999) 123-45-67)!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка первой части: +7
	Часть1 = МассивЧастейТелефона[0];
	Если Часть1 <> "+7" Тогда
		Сообщить("Контактный телефон должен начинаться с '+7'!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка второй части: (XXX)
	Часть2 = МассивЧастейТелефона[1];
	Если СтрДлина(Часть2) <> 5 Или Лев(Часть2, 1) <> "(" Или Прав(Часть2, 1) <> ")" Тогда
		Сообщить("Код региона в контактном телефоне должен быть в формате (XXX), например (999)!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	КодРегиона = Сред(Часть2, 2, 3);
	Для Позиция = 1 По СтрДлина(КодРегиона) Цикл
		Символ = Сред(КодРегиона, Позиция, 1);
		Если СтрНайти("0123456789", Символ) = 0 Тогда
			Сообщить("Код региона в контактном телефоне должен содержать только цифры!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка третьей части: XXX-XX-XX
	Часть3 = МассивЧастейТелефона[2];
	МассивПодчастей = СтрРазделить(Часть3, "-", Ложь);
	Если МассивПодчастей.Количество() <> 3 Тогда
		Сообщить("Номер телефона должен быть в формате XXX-XX-XX (например, 123-45-67)!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка XXX
	Если СтрДлина(МассивПодчастей[0]) <> 3 Тогда
		Сообщить("Первая часть номера телефона должна содержать 3 цифры!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Для Позиция = 1 По СтрДлина(МассивПодчастей[0]) Цикл
		Символ = Сред(МассивПодчастей[0], Позиция, 1);
		Если СтрНайти("0123456789", Символ) = 0 Тогда
			Сообщить("Первая часть номера телефона должна содержать только цифры!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка XX
	Если СтрДлина(МассивПодчастей[1]) <> 2 Тогда
		Сообщить("Вторая часть номера телефона должна содержать 2 цифры!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Для Позиция = 1 По СтрДлина(МассивПодчастей[1]) Цикл
		Символ = Сред(МассивПодчастей[1], Позиция, 1);
		Если СтрНайти("0123456789", Символ) = 0 Тогда
			Сообщить("Вторая часть номера телефона должна содержать только цифры!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка XX
	Если СтрДлина(МассивПодчастей[2]) <> 2 Тогда
		Сообщить("Третья часть номера телефона должна содержать 2 цифры!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Для Позиция = 1 По СтрДлина(МассивПодчастей[2]) Цикл
		Символ = Сред(МассивПодчастей[2], Позиция, 1);
		Если СтрНайти("0123456789", Символ) = 0 Тогда
			Сообщить("Третья часть номера телефона должна содержать только цифры!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Проверка обязательного поля ДобавочныйНомер
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДобавочныйНомер) Тогда
		Сообщить("Поле Добавочный номер не заполнено!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка формата ДобавочногоНомера (не более 5 цифр)
	ДобавочныйНомер = СокрЛП(ЭтотОбъект.ДобавочныйНомер);
	Если СтрДлина(ДобавочныйНомер) > 5 Тогда
		Сообщить("Добавочный номер не должен превышать 5 цифр!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Для Позиция = 1 По СтрДлина(ДобавочныйНомер) Цикл
		Символ = Сред(ДобавочныйНомер, Позиция, 1);
		Если СтрНайти("0123456789", Символ) = 0 Тогда
			Сообщить("Добавочный номер содержит недопустимые символы! Допустимы только цифры.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Автоматическое заполнение кода, если он пустой
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Код) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Сотрудники.Код
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	НЕ Сотрудники.ПометкаУдаления";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		МаксКод = 0;
		Пока Выборка.Следующий() Цикл
			// Пытаемся преобразовать код в число, игнорируя некорректные значения
			Попытка
				ТекКод = Число(Выборка.Код);
				МаксКод = Макс(МаксКод, ТекКод);
			Исключение
				// Игнорируем некорректные значения
				Продолжить;
			КонецПопытки;
		КонецЦикла;
		
		ЭтотОбъект.Код = Формат(МаксКод + 1, "ЧЦ=9; ЧВН=; ЧГ=0");

	КонецЕсли;
	
	// Проверка уникальности кода
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код = &Код
		|	И Сотрудники.Ссылка <> &ТекущаяСсылка
		|	И НЕ Сотрудники.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Код", ЭтотОбъект.Код);
	Запрос.УстановитьПараметр("ТекущаяСсылка", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Сообщить("Сотрудник с кодом """ + ЭтотОбъект.Код + """ уже существует!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
